In [82]:
import pandas as pd
import numpy as np
#여러변수출력코드
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [ ]:

s1 = pd.Series([10,20,30,40,50,60])
s1
print(s1)
s1.shape

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

(6,)

In [6]:
import pandas as pd

#튜플로 시리즈 만들기
data = (1,2,3,4,5,6)
print(pd.Series(data))

#리스트로 시리즈 만들기
data1 = ([1,2,3,4,5,6])
print(pd.Series(data1))

#딕셔너리로 시리즈 만들기
data1 = {1:1, 2:2, 3:3, 4:4, 5:5, 6:6}
print(pd.Series(data1)
)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int64

In [7]:
import numpy as np

pd.Series(np.arange(100))

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int32

In [26]:
s2 = pd.Series(['a','b',1.2, 5, 3.5, 'c'])
print(s2)

0      a
1      b
2    1.2
3      5
4    3.5
5      c
dtype: object

In [30]:
index_data = ['2024-08-07','2024-08-08','2024-08-09','2024-08-10','2024-08-11']
s2 = pd.Series([500, 200, np.nan, 300, np.nan ])
print(s2)
print(s2.shape)

0    500.0
1    200.0
2      NaN
3    300.0
4      NaN
dtype: float64
(5,)

In [48]:
s1 = pd.Series([10,20,30,40,50,60])

print(s1.index)
print(s1.values)
s2= s1.to_dict()
s3 = s1.to_json()
print(s2)
print(s3)

RangeIndex(start=0, stop=6, step=1)
[10 20 30 40 50 60]
{0: 10, 1: 20, 2: 30, 3: 40, 4: 50, 5: 60}
{"0":10,"1":20,"2":30,"3":40,"4":50,"5":60}

In [41]:
s5 = pd.Series({'국어':100, '영어':95, '수학':90})
print(s5)
print()
print(s5.index)
print()
print(s5.values)
print(s5.dtype)
print(type(s5))

국어    100
영어     95
수학     90
dtype: int64

Index(['국어', '영어', '수학'], dtype='object')

[100  95  90]
int64
<class 'pandas.core.series.Series'>

In [8]:
s = pd.Series([1,2,3,np.nan, 6,8])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [13]:
s=pd.Series([10,20,30],index=[1,2,3])
s1=pd.Series([10,20,30],index=['a','b','c'])

print(s)
print(s1)

1    10
2    20
3    30
dtype: int64
a    10
b    20
c    30
dtype: int64

In [17]:
s= pd.Series([9904312,3448737,289045,2466052],
index=["서울","부산","인천","대구"]) 
s.index.name = '광역시'

In [25]:
print(s)
print('========')
print(s.index)

광역시
서울    9904312
부산    3448737
인천     289045
대구    2466052
dtype: int64
========
Index(['서울', '부산', '인천', '대구'], dtype='object', name='광역시')

In [26]:
s.values

array([9904312, 3448737,  289045, 2466052], dtype=int64)

In [27]:
s.name='인구'
s

광역시
서울    9904312
부산    3448737
인천     289045
대구    2466052
Name: 인구, dtype: int64

In [16]:
print(s.index)
print(s1.index)

Index([1, 2, 3], dtype='int64')
Index(['a', 'b', 'c'], dtype='object')

In [40]:
print(f'1,3,번 인덱스 각각 추출  \n{s[[1,3]]} \n') #1,3번 인덱스 값 각각 추출
print(s[['부산','인천']]) #라벨이 부산,인천인 값 추출
print(s[0:2]) # 인덱스1
#문자 인덱스를 이용한 슬라이싱
print(s['부산':'대구'])

 1,3,번 인덱스 각각 추출
광역시
부산    3448737
대구    2466052
Name: 인구, dtype: int64

광역시
부산    3448737
인천     289045
Name: 인구, dtype: int64
광역시
서울    9904312
부산    3448737
Name: 인구, dtype: int64
광역시
부산    3448737
인천     289045
대구    2466052
Name: 인구, dtype: int64

C:\Users\user\AppData\Local\Temp\ipykernel_23056\887346405.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f' 1,3,번 인덱스 각각 추출  \n{s[[1,3]]} \n') #1,3번 인덱스 값 각각 추출

In [102]:
df = pd.DataFrame
a1 = df(np.arange(1,21).reshape(4,5))

a1

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20

In [106]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [101]:
df = pd.DataFrame
a1 = df(np.arange(1,21).reshape(4,5))
a1.index= range(1,5)
a1.columns = range(1,6)

a1

    1   2   3   4   5
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20

In [100]:
a3 = a1.iloc[1:, 2:]
a3.index = range(1,4)
a3.columns = range(1,4)
a3

    1   2   3
1   8   9  10
2  13  14  15
3  18  19  20

In [118]:
table_data = {'연도': [2015, 2016, 2016, 2017, 2017],
              '지사': ['한국', '한국', '미국', '한국','미국'],
              '고객 수': [200, 250, 450, 300, 500]}
table_data
t1 = pd.DataFrame(table_data)
print("테이블 인덱스 : ",t1.index)
print("테이블 벨류: ",t1.values)
print("테이블 컬럼 : ",t1.columns)

테이블 인덱스 :  RangeIndex(start=0, stop=5, step=1)
테이블 벨류:  [[2015 '한국' 200]
 [2016 '한국' 250]
 [2016 '미국' 450]
 [2017 '한국' 300]
 [2017 '미국' 500]]
테이블 컬럼 :  Index(['연도', '지사', '고객 수'], dtype='object')

In [126]:
s3 = pd.Series([1, 2, 3, 4])
s4 = pd.Series([10, 20, 30, 40, 50])

print(f'뺄셈 => \n{s4 - s3}')
print(f'곱셈 => \n{s3 * s4}')

뺄셈 =>
0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64
곱셈 =>
0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64

In [135]:
table_data1 = {'A': [1, 2, 3, 4, 5],
              'B': [10, 20, 30, 40, 50],
              'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_data1)
print(df1)

print('====================')
table_data2 = {'A': [6, 7, 8],
              'B': [60, 70, 80],
              'C': [600, 700, 800]}
df2 = pd.DataFrame(table_data2)
print(df2)

print('==================')

print(df1+df2)

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500
====================
   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800
==================
      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [110]:
table_data3 = {'봄':  [256.5, 264.3, 215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']


df3 = pd.DataFrame(table_data3, columns=columns_list, index=index_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [185]:
df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [3]:
df1 =pd.DataFrame(np.arange(33,43).reshape(2,5))
df2 =pd.DataFrame(np.arange(20,30).reshape(5,2))

print(df1)
df1.sum(axis=1)

    0   1   2   3   4
0  33  34  35  36  37
1  38  39  40  41  42

0    175
1    200
dtype: int64

In [138]:

KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']
df1 = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df1

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011       39060        7313        3627         309         NaN
2012       39896        6967        4168        1771         NaN
2013       42005        6873        4088        1954         NaN
2014       43621        6626        4424        2244         NaN
2015       41702        8675        4606        3146      2395.0
2016       41266       10622        4984        3945      3786.0
2017       32427        9228        5570        5766      6667.0

In [151]:
df2 = df1.reset_index()
df2.iloc[:,1:4]

   경부선 KTX  호남선 KTX  경전선 KTX
0       39060        7313        3627
1       39896        6967        4168
2       42005        6873        4088
3       43621        6626        4424
4       41702        8675        4606
5       41266       10622        4984
6       32427        9228        5570

In [126]:
type(df2)

pandas.core.frame.DataFrame

In [127]:
type(df1.loc['2011':'2014','호남선 KTX'])

pandas.core.series.Series

In [161]:
df1.index
df1.values
df1.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [156]:
df1.index

AttributeError: 'Index' object has no attribute 'dtypes'

In [4]:
df1 = pd.DataFrame({'class1':[95,92,98,100],
                    'class2':[91,93,97,99]})
df1

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99

In [5]:
df2 = pd.DataFrame({'class1':[85,82],
                    'class2':[81,83]})
df2

   class1  class2
0      85      81
1      82      83

In [6]:
catpd =pd.concat([df1,df2])
catpd

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99
0      85      81
1      82      83

In [7]:
df3 = pd.DataFrame({'class1':[85,82]})
df3

   class1
0      85
1      82

In [8]:
df4=pd.concat([catpd,df3]).reset_index(names='index',drop='index')
df4
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   class1  8 non-null      int64
 1   class2  6 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 260.0 bytes

In [9]:
df1 = pd.DataFrame({'class':[93,91,95,98]})
df1

   class
0     93
1     91
2     95
3     98

In [10]:
df4

   class1  class2
0      95    91.0
1      92    93.0
2      98    97.0
3     100    99.0
4      85    81.0
5      82    83.0
6      85     NaN
7      82     NaN

In [193]:
jdf1=df4.join(df1)
jdf1

   class1  class2  class
0      95    91.0   93.0
1      92    93.0   91.0
2      98    97.0   95.0
3     100    99.0   98.0
4      85    81.0    NaN
5      82    83.0    NaN
6      85     NaN    NaN
7      82     NaN    NaN

In [92]:
%%writefile sea_rain1.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Writing sea_rain1.csv

In [93]:
df= pd.read_csv('./sea_rain1.csv')
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [17]:
%%writefile sea_rain1_space.txt
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Writing sea_rain1_space.txt

In [36]:
df1 = pd.read_csv('./sea_rain1_space.txt', sep=' ')
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   연도      5 non-null      int64
 1   동해      5 non-null      float64
 2   남해      5 non-null      float64
 3   서해      5 non-null      float64
 4   전체      5 non-null      float64
dtypes: float64(4), int64(1)
memory usage: 332.0 bytes

In [42]:
df3 = pd.read_csv('./sea_rain1.csv')
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   연도      5 non-null      int64
 1   동해      5 non-null      float64
 2   남해      5 non-null      float64
 3   서해      5 non-null      float64
 4   전체      5 non-null      float64
dtypes: float64(4), int64(1)
memory usage: 332.0 bytes

In [86]:
df2 = pd.read_csv('./sea_rain1.csv', index_col='연도')

df2

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [89]:
df2.drop(columns='동해')

           남해       서해       전체
연도
1996  17.2288  14.4360  15.9067
1997  17.4092  14.8248  16.1526
1998  18.0110  15.2512  16.6044
1999  18.3175  14.8979  16.6284
2000  18.1766  15.0504  16.6178

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1996 to 2000
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   동해      5 non-null      float64
 1   남해      5 non-null      float64
 2   서해      5 non-null      float64
 3   전체      5 non-null      float64
dtypes: float64(4)
memory usage: 200.0 bytes

In [34]:
df2.index

Index([1996, 1997, 1998, 1999, 2000], dtype='int64', name='연도')

In [43]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74],
                      'Height':[165, 177, 160, 180]},
index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [44]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [45]:
df_WH['BMI'] = bmi
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [46]:
df_WH.to_csv('./save_BMI_dataFram.csv', encoding='cp949')

In [48]:
!type save_BMI_dataFram.csv

User,Weight,Height,BMI
ID_1,62,165,22.77318640955005
ID_2,67,177,21.38593635289987
ID_3,55,160,21.484374999999996
ID_4,74,180,22.839506172839506

In [49]:
df_pr = pd.DataFrame({'판매가격':[2000, 3000, 5000, 10000],
											'판매량':[32, 53, 40, 25]},
	index=['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [50]:
df_pr.to_csv('./save_price.txt', sep=' ', encoding='cp949')

In [51]:
!type save_price.txt

��ǰ��ȣ �ǸŰ��� �Ǹŷ�
P1001 2000 32
P1002 3000 53
P1003 5000 40
P1004 10000 25

In [53]:
s= pd.Series([9904312,3448737,289045,2466052],
index=["서울","부산","인천","대구"])
s

서울    9904312
부산    3448737
인천     289045
대구    2466052
dtype: int64

In [54]:
s['부산':'인천']

부산    3448737
인천     289045
dtype: int64

In [68]:
s.index.name = '광역시'
s.name='인구'
s
df = s.to_frame()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 대구
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   인구      4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [2]:
df = pd.DataFrame([['a','b','c'],['e','f','g'],['h','i','j']])
df

   0  1  2
0  a  b  c
1  e  f  g
2  h  i  j

In [3]:
df2 = pd.DataFrame({
  'A' : [1,2,3],
  'B' : [4,5,6],
  'C' : [7,8,9]
})

df2

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [7]:
df2 = pd.DataFrame({
  'A' : [1,2,3],
  'B' : [4,5,6],
  'C' : [7,8,9]
},index=[10,20,30])
df2

    A  B  C
10  1  4  7
20  2  5  8
30  3  6  9

In [16]:
a = pd.Series([100,200,300],['a','b','d'])
b = pd.Series([101,102,103],['a','b','k'])
c = pd.Series([110,210,310],['a','b','c'])
pd.DataFrame([a,b,c],index=[100,101,102])

         a      b      d      k      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  102.0    NaN  103.0    NaN
102  110.0  210.0    NaN    NaN  310.0

In [21]:
a

a    100
b    200
d    300
dtype: int64

In [9]:
a = pd.Series([100,200,300],['a','b','d'])
b = pd.Series([101,102,103],['a','b','k'])
c = pd.Series([110,210,310],['a','b','c'])
pd.DataFrame([a,b,c])

       a      b      d      k      c
0  100.0  200.0  300.0    NaN    NaN
1  101.0  102.0    NaN  103.0    NaN
2  110.0  210.0    NaN    NaN  310.0

In [81]:
s_data = pd.read_csv('../Mini_Project/Project_2/seoulCCTV.csv', sep=',', encoding='utf-8')
s_data.head()
print(s_data.columns)
print()
print(s_data.values)
print()
print(s_data.value_counts())

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

[['강남구' 2780 1292 430 584 932]
 ['강동구' 773 379 99 155 377]
 ['강북구' 748 369 120 138 204]
 ['강서구' 884 388 258 184 81]
 ['관악구' 1496 846 260 390 613]
 ['광진구' 707 573 78 53 174]
 ['구로구' 1561 1142 173 246 323]
 ['금천구' 1015 674 51 269 354]
 ['노원구' 1265 542 57 451 516]
 ['도봉구' 485 238 159 42 386]
 ['동대문구' 1294 1070 23 198 579]
 ['동작구' 1091 544 341 103 314]
 ['마포구' 574 314 118 169 379]
 ['서대문구' 962 844 50 68 292]
 ['서초구' 1930 1406 157 336 398]
 ['성동구' 1062 730 91 241 265]
 ['성북구' 1464 1009 78 360 204]
 ['송파구' 618 529 21 68 463]
 ['양천구' 2034 1843 142 30 467]
 ['영등포구' 904 495 214 195 373]
 ['용산구' 1624 1368 218 112 398]
 ['은평구' 1873 1138 224 278 468]
 ['종로구' 1002 464 314 211 630]
 ['중구' 671 413 190 72 348]
 ['중랑구' 660 509 121 177 109]]

기관명   소계    2013년도 이전  2014년  2015년  2016년
강남구   2780  1292       430    584    932      1
서대문구  962   844        50     68     292      1
중구    671   413        190    72     348      1
종로구   1002  464        314    211    630      1
은평구   1873  1138       224    278    468      1
용산구   1624  1368       218    112    398      1
영등포구  904   495        214    195    373      1
양천구   2034  1843       142    30     467      1
송파구   618   529        21     68     463      1
성북구   1464  1009       78     360    204      1
성동구   1062  730        91     241    265      1
서초구   1930  1406       157    336    398      1
마포구   574   314        118    169    379      1
강동구   773   379        99     155    377      1
동작구   1091  544        341    103    314      1
동대문구  1294  1070       23     198    579      1
도봉구   485   238        159    42     386      1
노원구   1265  542        57     451    516      1
금천구   1015  674        51     269    354      1
구로구   1561  1142       173    246    323      1
광진구   707   573        78     53     174      1
관악구   1496  846        260    390    613      1
강서구   884   388        258    184    81       1
강북구   748   369        120    138    204      1
중랑구   660   509        121    177    109      1
Name: count, dtype: int64

In [102]:
arrays = [['bar', 'bar', 'baz', 'baz'], ['one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(4,2), index=index, columns=['A', 'B'])

In [103]:
df

                     A         B
first second
bar   one     0.711907 -0.860669
      two     1.385818  0.509163
baz   one    -2.114601 -1.089545
      two     0.569902 -0.375350

In [113]:
value = df.loc[('bar', 'one'), 'B']
value

-0.8606691019082645

In [114]:
row = df.loc[('baz', 'two')]
row

A    0.569902
B   -0.375350
Name: (baz, two), dtype: float64

In [120]:
sel = df.xs('two', level='second')
sel

              A         B
first
bar    1.385818  0.509163
baz    0.569902 -0.375350

In [37]:
import numpy as np
import pandas as pd

columns = pd.MultiIndex.from_tuples([
    ('A', 'one'), ('A', 'two'),
    ('B', 'one'), ('B', 'two')
])
df2 = pd.DataFrame(np.arange(1,36,3).reshape(3,4), columns=columns)

In [38]:
df2

    A       B
  one two one two
0   1   4   7  10
1  13  16  19  22
2  25  28  31  34

In [39]:
df2[('B','two')] = df2[('B','two')] *2

In [40]:
df2

    A       B
  one two one two
0   1   4   7  20
1  13  16  19  44
2  25  28  31  68

In [70]:
df2['C','two'] = 70,80,70

In [72]:
df2

    A       B       C
  one two one two one two
0   1   4   7  20  10  70
1  13  16  19  44  20  80
2  25  28  31  68  30  70

In [90]:
df2['A']

   one  two
0    1    4
1   13   16
2   25   28

In [89]:
df2[('A','two')]

0     4
1    16
2    28
Name: (A, two), dtype: int32

In [88]:
df2[[('A','two')]]

    A
  two
0   4
1  16
2  28

In [85]:
[df2.B.one]

[[0     7
  1    19
  2    31
  Name: one, dtype: int32]]

In [94]:
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [95]:
df.연도

0    1996
1    1997
2    1998
3    1999
4    2000
Name: 연도, dtype: int64

In [116]:
df['연도']

0    1996
1    1997
2    1998
3    1999
4    2000
Name: 연도, dtype: int64

In [117]:
df[['연도']]

     연도
0  1996
1  1997
2  1998
3  1999
4  2000

In [124]:
try : 
  df[3]
except Exception as e:
  print(f'에러발생 {type(e).__name__}: {e}')

에러발생 KeyError: 3

In [136]:
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [187]:
df1=df.T

In [141]:
df1.loc['연도',:] = df1.loc['연도',:].astype(int)

In [147]:
df1

            0          1          2          3          4
연도  1996.0000  1997.0000  1998.0000  1999.0000  2000.0000
동해    17.4629    17.4116    17.5944    18.1495    17.9288
남해    17.2288    17.4092    18.0110    18.3175    18.1766
서해    14.4360    14.8248    15.2512    14.8979    15.0504
전체    15.9067    16.1526    16.6044    16.6284    16.6178

In [146]:
df1.loc['연도'] = df1.loc['연도'].astype(int)

In [153]:
df1

            0          1          2          3          4
연도  1996.0000  1997.0000  1998.0000  1999.0000  2000.0000
동해    17.4629    17.4116    17.5944    18.1495    17.9288
남해    17.2288    17.4092    18.0110    18.3175    18.1766
서해    14.4360    14.8248    15.2512    14.8979    15.0504
전체    15.9067    16.1526    16.6044    16.6284    16.6178

In [172]:
df1[2]['동해']

17.5944

In [176]:
df1[2]

연도    1998.0000
동해      17.5944
남해      18.0110
서해      15.2512
전체      16.6044
Name: 2, dtype: float64

In [178]:
df1[[2]]

            2
연도  1998.0000
동해    17.5944
남해    18.0110
서해    15.2512
전체    16.6044

In [182]:
df1[[1,3]]['남해':'남해']

          1        3
남해  17.4092  18.3175

In [185]:
df1.drop('연도',inplace=True)

In [188]:
df1

            0          1          2          3          4
연도  1996.0000  1997.0000  1998.0000  1999.0000  2000.0000
동해    17.4629    17.4116    17.5944    18.1495    17.9288
남해    17.2288    17.4092    18.0110    18.3175    18.1766
서해    14.4360    14.8248    15.2512    14.8979    15.0504
전체    15.9067    16.1526    16.6044    16.6284    16.6178

In [203]:
df1.drop(0,axis=1)

            1          2          3          4
연도  1997.0000  1998.0000  1999.0000  2000.0000
동해    17.4116    17.5944    18.1495    17.9288
남해    17.4092    18.0110    18.3175    18.1766
서해    14.8248    15.2512    14.8979    15.0504
전체    16.1526    16.6044    16.6284    16.6178

In [201]:
df1.drop(columns=1)

            0          2          3          4
연도  1996.0000  1998.0000  1999.0000  2000.0000
동해    17.4629    17.5944    18.1495    17.9288
남해    17.2288    18.0110    18.3175    18.1766
서해    14.4360    15.2512    14.8979    15.0504
전체    15.9067    16.6044    16.6284    16.6178

In [190]:
df1

            0          1          2          3          4
연도  1996.0000  1997.0000  1998.0000  1999.0000  2000.0000
동해    17.4629    17.4116    17.5944    18.1495    17.9288
남해    17.2288    17.4092    18.0110    18.3175    18.1766
서해    14.4360    14.8248    15.2512    14.8979    15.0504
전체    15.9067    16.1526    16.6044    16.6284    16.6178

In [204]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4), index=['a','b','c'],
                  columns=['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [210]:
df.loc[['a']]

    A   B   C   D
a  10  11  12  13

In [211]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [212]:
df.loc[:'a']

    A   B   C   D
a  10  11  12  13

In [209]:
df[:'a']

    A   B   C   D
a  10  11  12  13

In [213]:
df.loc[:,'A']

a    10
b    14
c    18
Name: A, dtype: int32

In [214]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [227]:
df.iloc[0]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [224]:
df.iloc[0:1]

    A   B   C   D
a  10  11  12  13

In [222]:
df.iloc[[0]]

    A   B   C   D
a  10  11  12  13

In [229]:
df.value_counts()

A   B   C   D
10  11  12  13    1
14  15  16  17    1
18  19  20  21    1
Name: count, dtype: int64

In [231]:
df=pd.DataFrame({
  'num_legs': [2,4,4,6],
  'num_wings': [2,0,0,0]},
  index=['falcon','dog','cat','ant'])
df

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

In [233]:
df.value_counts()

num_legs  num_wings
4         0            2
2         2            1
6         0            1
Name: count, dtype: int64

In [234]:
df

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

In [235]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4), index=['a','b','c'],
                  columns=['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [237]:
df.loc['a','A']=50

In [238]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [246]:
print(df.loc[['a'],['B','C']])
print(df.iloc[0,1:3])
print(df['B']['a'],df['C']['a'])

    B   C
a  11  12
B    11
C    12
Name: a, dtype: int32
11 12

In [248]:
df.loc[['a'],['B','C']]

    B   C
a  11  12

In [249]:
df.iloc[[0],1:3]

    B   C
a  11  12

In [250]:
df.loc['a',['B','C']]

B    11
C    12
Name: a, dtype: int32

In [275]:
df.sort_values(ascending=False, by='B')

    A   B   C   D
c  18  19  20  21
b  14  15  16  17
a  50  11  12  13

In [6]:
df = pd.DataFrame(np.nan ,index=range(5),columns=['A', 'B', 'C'])
df

    A   B   C
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN
4 NaN NaN NaN

In [15]:
df.fillna(5).astype(int).dtypes

A    int32
B    int32
C    int32
dtype: object

In [16]:
df

    A   B   C
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN
4 NaN NaN NaN

In [21]:
#구간을 나눌 실제 값 : 관측 데이터
ages=[0,0.5,4,6,4,5,2,10,21,23,37,15,38,31,61,20,41,31,100]

#구간 경계값 설정 - bins
#구간 최소값 < 구간 <= 구간 최댓값
bins=[0,4,18,25,35,60,100]

#각 구간의 이름 - label
#순서는 구간(bins)의 순서 및 개수와 동일해야한다.
labels = ['영유아','미성년자','청년','중년','장년','노년']

In [22]:
cats=pd.cut(ages,bins,labels=labels)
cats

[NaN, '영유아', '영유아', '미성년자', '영유아', ..., '노년', '청년', '장년', '중년', '노년']
Length: 19
Categories (6, object): ['영유아' < '미성년자' < '청년' < '중년' < '장년' < '노년']

In [17]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [18]:
cat_list = list(cats)
cat_list

[nan,
 '영유아',
 '영유아',
 '미성년자',
 '영유아',
 '미성년자',
 '영유아',
 '미성년자',
 '청년',
 '청년',
 '장년',
 '미성년자',
 '장년',
 '중년',
 '노년',
 '청년',
 '장년',
 '중년',
 '노년']

In [34]:
test = pd.DataFrame({'나이':ages, '연령대':cat_list})
test['연령대'].value_counts()

연령대
영유아     4
미성년자    4
청년      3
장년      3
중년      2
노년      2
Name: count, dtype: int64

In [59]:
#다시 실행해도 동일한 랜덤결과값을 얻기위해 seed부여
np.random.seed(1)
#0~20까지 랜덤값 20개 생성
data = np.random.randint(20, size=20)

qcat = pd.qcut(data,4,labels=['Q1','Q2','Q3','Q4'])
qcat

['Q1', 'Q3', 'Q3', 'Q2', 'Q2', ..., 'Q4', 'Q1', 'Q4', 'Q3', 'Q2']
Length: 20
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [60]:
test = pd.DataFrame({'숫자':data,'구간':qcat}).sort_values(by='숫자').reset_index(drop=True)
test

Unexpected exception formatting exception. Falling back to standard exception

Traceback (most recent call last):
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\formatters.py", line 223, in catch_format_error
    # 1. user-registered per-mime formatter
    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\formatters.py", line 344, in __call__
    """,

  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\core\frame.py", line 1175, in _repr_html_
    # check whether repr fits horizontal by actually checking
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\io\formats\format.py", line 1074, in to_html
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\io\formats\html.py", line 88, in to_string
    lines = self.render()
            ^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\io\formats\html.py", line 644, in render
    super().render()
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\io\formats\html.py", line 94, in render
    self._write_table()
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\io\formats\html.py", line 267, in _write_table
    self._write_header(indent + self.indent_delta)
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\io\formats\html.py", line 403, in _write_header
    self._write_col_header(indent + self.indent_delta)
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\io\formats\html.py", line 383, in _write_col_header
    row.extend(self._get_columns_formatted_values())
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\pandas\io\formats\html.py", line 611, in _get_columns_formatted_values
    return self.columns._format_flat(include_name=False)
           ^^^^^^^^^^^^^^^^^^^^^^^^^
AttributeError: 'Index' object has no attribute '_format_flat'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\interactiveshell.py", line 2144, in showtraceback
    'the full traceback.\n']
               ^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\ultratb.py", line 1435, in structured_traceback
    # that to the clients.
           ^^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\ultratb.py", line 1326, in structured_traceback
    # NEVER change the order of this list. Put new modes at the end:
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\ultratb.py", line 1173, in structured_traceback
    code = frame.f_code
                  ^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\ultratb.py", line 1088, in format_exception_as_a_whole
    frames = []

  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\ultratb.py", line 970, in format_record
    else:

  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\IPython\core\ultratb.py", line 792, in lines
    @property

  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\stack_data\utils.py", line 145, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
                                               ^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\stack_data\core.py", line 698, in lines
    pieces = self.included_pieces
             ^^^^^^^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\stack_data\utils.py", line 145, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
                                               ^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\stack_data\core.py", line 649, in included_pieces
    pos = scope_pieces.index(self.executing_piece)
                             ^^^^^^^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\stack_data\utils.py", line 145, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
                                               ^^^^^^^^^^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\stack_data\core.py", line 628, in executing_piece
    return only(
           ^^^^^
  File "c:\Users\hhhmh\anaconda3\Lib\site-packages\executing\executing.py", line 164, in only
    raise NotOneValueFound('Expected one value, found 0')
executing.executing.NotOneValueFound: Expected one value, found 0

    숫자  구간
0    0  Q1
1    1  Q1
2    5  Q1
3    5  Q1
4    5  Q1
5    6  Q2
6    7  Q2
7    8  Q2
8    9  Q2
9   10  Q2
10  11  Q3
11  11  Q3
12  11  Q3
13  12  Q3
14  12  Q3
15  13  Q4
16  15  Q4
17  16  Q4
18  18  Q4
19  18  Q4

In [2]:
#예시 df 생성 - 고객 정보를 담고 있는 df
df1=pd.DataFrame({'고객번호': [1001,1002,1003,1004,1005,1006,1007],
                  '이름': ['둘리','도우너','또치','길동','희동','마이콜','영희']},
                 columns=['고객번호','이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [3]:
#예제 df 생성 - 예금 정보 df
df2=pd.DataFrame({'고객번호':[1001,1001,1005,1006,1008,1001],
                  '금액': [10000,20000,15000,5000,100000,30000]},
                  columns=['고객번호','금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [7]:
#예제 df 생성
#열: 품종, 꽃잎길이
df1=pd.DataFrame({'품종':['setosa','setosa','virginica','virginica'],
                  '꽃잎길이':[1.4,1.3,1.5,1.3]},
                  columns=['품종','꽃잎길이'])
df1

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [8]:
#열 : 품종, 꽃잎너비
df2=pd.DataFrame({'품종': ['setosa','virginica','virginica','ersicolor'],
                  '꽃잎너비':[0.4,0.3,0.5,0.3]},
                  columns=['품종','꽃잎너비'])
df2

          품종  꽃잎너비
0     setosa   0.4
1  virginica   0.3
2  virginica   0.5
3  ersicolor   0.3

In [9]:
df1.merge(df2)

          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

In [23]:
df1=pd.DataFrame({'고객명':['춘향','춘향','몽룡'],
                  '날짜': ['2018-01-01','2018-01-02','2018-01-01'],
                  '데이터':[20000,30000,100000]})
df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [24]:
df2=pd.DataFrame({'고객명':['춘향','몽룡'],
                  '데이터':['여자','남자']})
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [26]:
df1.merge(df2, on='고객명', suffixes=('_df1','_df2'))

  고객명          날짜  데이터_df1 데이터_df2
0  춘향  2018-01-01    20000      여자
1  춘향  2018-01-02    30000      여자
2  몽룡  2018-01-01   100000      남자

In [22]:
df1.merge(df2, on='데이터', suffixes=('df1','df2'))

Empty DataFrame
Columns: [고객명df1, 날짜, 데이터, 고객명df2]
Index: []

In [28]:
df1.데이터=df1.데이터.astype(str)

In [31]:
df2.데이터=df2.데이터.astype(str)

In [37]:
result = df1.merge(df2)
print(result)

Empty DataFrame
Columns: [고객명, 날짜, 데이터]
Index: []

In [41]:
df1=pd.DataFrame({'도시': ['서울','서울','서울','부산','부산'],'연도': [2000,2005,2010,2000,2005],
                  '인구':[9853972,9762546,9631482,3655437,3512547]})
df2=pd.DataFrame(np.arange(12).reshape((6,2)),
                 index=[['부산','부산','서울','서울','서울','서울'],[2000,2005,2000,2005,2010,2015]],
                 columns=['데이터1','데이터2']
)
df1

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547

In [40]:
df2

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [45]:
df2.xs(2010, level=1)

    데이터1  데이터2
서울     8     9

In [51]:
df1.merge(df2, left_on=['도시','연도'], right_index=True)

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [60]:
#두 시리즈 데이터 연결
s1=pd.Series([0,1],index=['A','B'])
s2=pd.Series([2,3,4],index=['A','B','C'])

print(s1)
print(s2)

A    0
B    1
dtype: int64
A    2
B    3
C    4
dtype: int64

In [59]:
pd.concat([s1,s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [62]:
df1=pd.DataFrame({'A': ['A0','A1','A2','A3'],
                  'B': ['B0','B1','B2','B3'],
                  'C': ['C0','C1','C2','C3'],
                  'D': ['D0','D1','D2','D3']},
                  index=[0,1,2,3])
df2=pd.DataFrame({'A': ['A4','A5','A6','A7'],
                  'B': ['B4','B5','B6','B7'],
                  'E': ['C4','C5','C6','C7'],
                  'F': ['D4','D5','D6','D7']},
                  index=[0,1,2,3])
df3=pd.DataFrame({'A': ['A8','A9','A10','A11'],
                  'B': ['B8','B9','B10','B11'],
                  'C': ['C8','C9','C10','C11'],
                  'O': ['D8','D9','D10','D11']},
                  index=[1,2,3,4])

In [64]:
result=pd.concat([df1,df2,df3],keys=['x','y','z'])
result

       A    B    C    D    E    F    O
x 0   A0   B0   C0   D0  NaN  NaN  NaN
  1   A1   B1   C1   D1  NaN  NaN  NaN
  2   A2   B2   C2   D2  NaN  NaN  NaN
  3   A3   B3   C3   D3  NaN  NaN  NaN
y 0   A4   B4  NaN  NaN   C4   D4  NaN
  1   A5   B5  NaN  NaN   C5   D5  NaN
  2   A6   B6  NaN  NaN   C6   D6  NaN
  3   A7   B7  NaN  NaN   C7   D7  NaN
z 1   A8   B8   C8  NaN  NaN  NaN   D8
  2   A9   B9   C9  NaN  NaN  NaN   D9
  3  A10  B10  C10  NaN  NaN  NaN  D10
  4  A11  B11  C11  NaN  NaN  NaN  D11

In [68]:
result=pd.concat([df1,df2,df3],keys=['df1','df2','df3'])
result

         A    B    C    D    E    F    O
df1 0   A0   B0   C0   D0  NaN  NaN  NaN
    1   A1   B1   C1   D1  NaN  NaN  NaN
    2   A2   B2   C2   D2  NaN  NaN  NaN
    3   A3   B3   C3   D3  NaN  NaN  NaN
df2 0   A4   B4  NaN  NaN   C4   D4  NaN
    1   A5   B5  NaN  NaN   C5   D5  NaN
    2   A6   B6  NaN  NaN   C6   D6  NaN
    3   A7   B7  NaN  NaN   C7   D7  NaN
df3 1   A8   B8   C8  NaN  NaN  NaN   D8
    2   A9   B9   C9  NaN  NaN  NaN   D9
    3  A10  B10  C10  NaN  NaN  NaN  D10
    4  A11  B11  C11  NaN  NaN  NaN  D11

In [69]:
result=pd.concat([df1,df2,df3],keys=['df1','df2','df3'],join='inner')
result

         A    B
df1 0   A0   B0
    1   A1   B1
    2   A2   B2
    3   A3   B3
df2 0   A4   B4
    1   A5   B5
    2   A6   B6
    3   A7   B7
df3 1   A8   B8
    2   A9   B9
    3  A10  B10
    4  A11  B11

In [70]:
result=pd.concat([df1,df2,df3],keys=['df1','df2','df3'],join='inner', ignore_index=True)
result

      A    B
0    A0   B0
1    A1   B1
2    A2   B2
3    A3   B3
4    A4   B4
5    A5   B5
6    A6   B6
7    A7   B7
8    A8   B8
9    A9   B9
10  A10  B10
11  A11  B11

In [78]:
result=pd.concat([df1,df2,df3],keys=['df1','df2','df3'],join='inner').reset_index(drop=True)
result

      A    B
0    A0   B0
1    A1   B1
2    A2   B2
3    A3   B3
4    A4   B4
5    A5   B5
6    A6   B6
7    A7   B7
8    A8   B8
9    A9   B9
10  A10  B10
11  A11  B11

In [90]:
# 예제 df 생성
df1=pd.DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['데이터1','데이터2'])
df2=pd.DataFrame(5+np.arange(4).reshape(2,2),index=['a','c'],columns=['데이터2','데이터4'])

In [91]:
df1
df2

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

   데이터2  데이터4
a     5     6
c     7     8

In [92]:
pd.concat([df1,df2],axis=1)

   데이터1  데이터2  데이터2  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

In [93]:
pd.concat([df1,df2],axis=0)

   데이터1  데이터2  데이터4
a   0.0     1   NaN
b   2.0     3   NaN
c   4.0     5   NaN
a   NaN     5   6.0
c   NaN     7   8.0

In [96]:
pd.concat([df1,df2],axis=1, join='inner', keys=['df1','df2'])

   df1       df2
  데이터1 데이터2 데이터2 데이터4
a    0    1    5    6
c    4    5    7    8

In [ ]:
df1=pd.DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['데이터1','데이터2'])

In [97]:
data ={
        "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"], 
        "연도":["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"], 
        "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203], 
        "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"] 
}

columns = ["도시", "연도", "인구", "지역"] 



df1 = pd.DataFrame(data, columns=columns) 
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [98]:
#각 도시에 대한 연도별 인구 평균균
df1.pivot_table(index="도시", columns='연도', values='인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [103]:
#각 지역별 도시에 대한 연도별 인구 평균균
df1.pivot_table(index=('지역','도시'), columns='연도',values='인구')

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0

In [105]:
import seaborn as sns

df = sns.load_dataset('titanic')[['age', 'sex','class', 'fare', 'survived']]
df.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [110]:
pdf1 = pd.pivot_table(df, #피벗할 데이터 프레임
                      index='class', # 행 인덱스
                      columns='sex', # 컬럼
                      values='survived', #계산 데이터로 사용할 열
                      aggfunc=['mean','sum'], #사용할 데이터 집계 함수
                      observed=False)
pdf1

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

In [112]:
np.random.seed(0) 
df2= pd.DataFrame({ 
'key1': ['A', 'A', 'B', 'B', 'A'], 
'key2': ['one', 'two', 'one', 'two', 'one'], 'data' : [1, 2, 3, 4, 5], 
'data2': [10, 20, 30, 40, 50] 
}) 
df2

  key1 key2  data  data2
0    A  one     1     10
1    A  two     2     20
2    B  one     3     30
3    B  two     4     40
4    A  one     5     50

In [113]:
groups = df2.groupby(df2.key1)
groups

In [119]:
groups.groups
groups.groups.keys()
groups.groups['A']
groups.groups.values()

{'A': [0, 1, 4], 'B': [2, 3]}

dict_keys(['A', 'B'])

Index([0, 1, 4], dtype='int64')

dict_values([Index([0, 1, 4], dtype='int64'), Index([2, 3], dtype='int64')])